Gilezzz/LanderEmbeddedSystem/LanderSTM/Drivers/STM-ZIGBEE-TOOLS/STM32W108xx_Zigbee_RF4CE_V2.0.1/Projects/RF4CE/ZRC_Coprocessor/STM3210E-EVAL/Project/src/rf4ce_cmds.c
/**
  ******************************************************************************
  * @file    rf4ce_cmds.c
  * @author  MCD Application Team
  * @version V2.0.1
  * @date    30-November-2012 
  * @brief   This file provides the host commands for nwk
  *          coprocessor implemenation
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
#include "rf4ce_nwkcop.h"
#include "stm32_sc.h"
#include "rf4ce.h"
#include <string.h>
#include <stdio.h>

/* Private define ------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
static uint32_t nwkCop_NLDE_DATA_indication(uint8_t *packet);
static uint32_t nwkCop_NLDE_DATA_confirm(uint8_t *packet);
static uint32_t nwkCop_NLME_AUTO_DISCOVERY_confirm(uint8_t *packet);
static uint32_t nwkCop_NLME_COMM_STATUS_indication(uint8_t *packet);
static uint32_t nwkCop_NLME_DISCOVERY_indication(uint8_t *packet);
static uint32_t nwkCop_NLME_DISCOVERY_confirm(uint8_t *packet);
static uint32_t nwkCop_NLME_PAIR_indication(uint8_t *packet);
static uint32_t nwkCop_NLME_PAIR_confirm(uint8_t *packet);
static uint32_t nwkCop_NLME_START_confirm(uint8_t *packet);
static uint32_t nwkCop_NLME_UNPAIR_indication(uint8_t *packet);
static uint32_t nwkCop_NLME_UNPAIR_confirm(uint8_t *packet);

/* Private macro -------------------------------------------------------------*/
/* Public variables ---------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/**@brief  network cop  nop
  *@param  None
  *@retval status
  */
uint32_t nwkCop_NOP(void)
{
  uint8_t cmd[]={0xc0, 0x05, 0x0, 0x01, 0x02, 0x03, 0x04, 0xfc};
  uint32_t status;
  uint8_t rsp[7];
  
  //printf("NOP Action started\r\n");
  status = sendHostCmd(cmd);
  if (status == SUCCESS) {
    status = waitRspCmd(rsp);
  }
  return status;
}

/**@brief  NLDE data request
  *@param  NLEDE data request type
  *@retval status
  */
uint32_t NLDE_DATA_request(NLDE_DATA_REQUEST_Type *param)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[200];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 7 + param->nsduLength;
  cmd[2] = NWKCOP_NLDE_DATA_REQUEST;
  cmd[3] = param->PairingRef;
  cmd[4] = param->ProfileId;
  memcpy(&cmd[5], &param->VendorId, 2);
  cmd[7] = param->nsduLength;
  memcpy(&cmd[8], param->nsdu, param->nsduLength);
  cmd[8+param->nsduLength] = param->TxOptions;
  cmd[9+param->nsduLength] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  NLDE data indication
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLDE_DATA_indication(uint8_t *packet)
{
  uint8_t paramLen, start;
  uint8_t *cmdParam;
  NLDE_DATA_INDICATION_Type param;
  uint8_t nsdu[128];

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen < 6)
    return NWKCOP_WRONG_PARAM_LENGTH;

  param.PairingRef = cmdParam[0];
  param.ProfileId = cmdParam[1];
  start = 2;
  if (cmdParam[paramLen-1] & (1 << 2)) {
    memcpy(&param.VendorId, &cmdParam[2], 2);
    start = 4;
  }
  param.nsduLength = cmdParam[start];
  memcpy(nsdu, &cmdParam[start+1], param.nsduLength);
  param.nsdu = nsdu;
  param.RxLinkQuality = cmdParam[start+1+param.nsduLength];
  param.RxFlags = cmdParam[start+2+param.nsduLength];

  NLDE_DATA_indication(&param);
  
  return SUCCESS;
}

/**@brief  network cop NLDE data confirmation
  *@param  packet
  *@retval Success
  */
static uint32_t nwkCop_NLDE_DATA_confirm(uint8_t *packet)
{
  uint8_t paramLen;
  uint8_t *cmdParam;
  NLDE_DATA_CONFIRM_Type param;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen < 5)
    return NWKCOP_WRONG_PARAM_LENGTH;

  memcpy(&param.Status, cmdParam, 4);
  param.PairingRef = cmdParam[4];

  NLDE_DATA_confirm(&param);

  return SUCCESS;
}

/**@brief  NLME auto discovery request
  *@param  NLME_AUTO_DISCOVERY_REQUEST_Type
  *@retval status
  */
uint32_t NLME_AUTO_DISCOVERY_request(NLME_AUTO_DISCOVERY_REQUEST_Type *param)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[255];
  uint8_t numDev, numProf;

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[2] = NWKCOP_NLME_AUTO_DISCOVERY_REQUEST;
  cmd[3] = param->RecAppCapabilities;
  numDev = (param->RecAppCapabilities>>1) & 0x01;
  numProf = (param->RecAppCapabilities>>4) & 0x07;
  memcpy(&cmd[4], param->RecDevTypeList, numDev);
  memcpy(&cmd[4+numDev], param->RecProfileIdList, numProf);
  memcpy(&cmd[4+numDev+numProf], &param->AutoDiscDuration, 4);
  cmd[1] = 0x6 + numDev + numProf ;
  cmd[8+numDev+numProf] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  NLME network cop auto discovery confirmation
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLME_AUTO_DISCOVERY_confirm(uint8_t *packet)
{
  uint8_t paramLen;
  uint8_t *cmdParam;
  NLME_AUTO_DISCOVERY_CONFIRM_Type param;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen < 12)
    return NWKCOP_WRONG_PARAM_LENGTH;

  memcpy(&param.Status, cmdParam, 4);
  memcpy(param.Addr, &cmdParam[4], 8);

  NLME_AUTO_DISCOVERY_confirm(&param);

  return SUCCESS;
}

