Gilezzz/LanderEmbeddedSystem/LanderSTM/Drivers/STM-ZIGBEE-TOOLS/STM32W108xx_Zigbee_RF4CE_V2.0.1/Projects/RF4CE/ZRC_Coprocessor/STM3210E-EVAL/Project/src/rf4ce_cmds.c
/**@brief  NLME network cop comm status indication
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLME_COMM_STATUS_indication(uint8_t *packet)
{
  uint8_t paramLen, addrLen;
  uint8_t *cmdParam;
  NLME_COMM_STATUS_INDICATION_Type param;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];

  if ((paramLen !=  10) && (paramLen != 16))
    return NWKCOP_WRONG_PARAM_LENGTH;

  param.PairingRef = cmdParam[0];
  memcpy(&param.DstPANId, &cmdParam[1], 2);
  param.DstAddrMode = cmdParam[3];
  if (param.DstAddrMode == 1) {
    memcpy(param.DstAddr.IEEEAddress, &cmdParam[4], 8);
    addrLen = 8;
  } else {
    memcpy(&param.DstAddr.ShortAddress, &cmdParam[4], 2);
    addrLen = 2;
  }
  memcpy(&param.Status, &cmdParam[4+addrLen], 4);

  NLME_COMM_STATUS_indication (&param);

  return SUCCESS;
}

/**@brief  NLME discovery request
  *@param  NLME_DISCOVERY_REQUEST_Type
  *@retval status
  */
uint32_t NLME_DISCOVERY_request(NLME_DISCOVERY_REQUEST_Type *param)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[255];
  uint8_t numDev, numProf;

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[2] = NWKCOP_NLME_DISCOVERY_REQUEST;
  memcpy(&cmd[3], &param->DstPANId, 2);
  memcpy(&cmd[5], &param->DstNwkAddr, 2);
  cmd[7] = param->OrgAppCapabilities;
  numDev = (param->OrgAppCapabilities>>4) & 0x01;
  numProf = (param->OrgAppCapabilities>>4) & 0x07;
  memcpy(&cmd[8], param->OrgDevTypeList, numDev);
  memcpy(&cmd[8+numDev], param->OrgProfileIdList, numProf);
  cmd[8+numDev+numProf] = param->SearchDevType;
  cmd[9+numDev+numProf] = param->DiscProfileIdListSize;
  memcpy(&cmd[10+numDev+numProf], param->DiscProfileIdList, param->DiscProfileIdListSize);
  memcpy(&cmd[10+numDev+numProf+param->DiscProfileIdListSize], &param->DiscDuration, 4);
  cmd[1] = 12 + numDev + numProf + param->DiscProfileIdListSize;
  cmd[14+numDev+numProf+param->DiscProfileIdListSize] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  NLME network cop discovery indication
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLME_DISCOVERY_indication(uint8_t *packet)
{
  uint8_t paramLen, numDev, numProf, start;
  uint8_t *cmdParam;
  NLME_DISCOVERY_INDICATION_Type param;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen < 19)
    return NWKCOP_WRONG_PARAM_LENGTH;

  memset(param.OrgUserString, 0, sizeof(param.OrgUserString));
  memset(param.OrgVendorString, 0, sizeof(param.OrgVendorString));
  memset(param.OrgDevTypeList, 0, sizeof(param.OrgDevTypeList));
  memset(param.OrgProfileIdList, 0, sizeof(param.OrgProfileIdList));

  param.Status = cmdParam[0];
  memcpy(param.SrcIEEEAddr, &cmdParam[1], 8);
  param.OrgNodeCapabilities = cmdParam[9];
  memcpy(&param.OrgVendorId, &cmdParam[10], 2);
  memcpy(param.OrgVendorString, &cmdParam[12], 8);
  param.OrgAppCapabilities = cmdParam[20];
  numDev = (param.OrgAppCapabilities>>1) & 0x01;
  numProf = (param.OrgAppCapabilities>>4) & 0x07;
  if (param.OrgAppCapabilities&0x01) {
    memcpy(param.OrgUserString, &cmdParam[21], 16);
    start = 37;
  } else {
    start = 21;
  }
  memcpy(param.OrgDevTypeList, &cmdParam[start], numDev);
  memcpy(param.OrgProfileIdList, &cmdParam[start+numDev], numProf);
  param.SearchDevType = cmdParam[start+numDev+numProf];
  param.RxLinkQuality = cmdParam[start+numDev+numProf+1];
  
  NLME_DISCOVERY_indication(&param);

  return SUCCESS;
}

/**@brief  NLME discovery response
  *@param  NLME_DISCOVERY_RESPONSE_Type
  *@retval status
  */
uint32_t NLME_DISCOVERY_response(NLME_DISCOVERY_RESPONSE_Type *param)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[255];
  uint8_t numDev, numProf;

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[2] = NWKCOP_NLME_DISCOVERY_RESPONSE;
  cmd[3] = param->Status;
  memcpy(&cmd[4], param->DstIEEEAddr, 8);
  cmd[12] = param->RecAppCapabilities;
  numDev = (param->RecAppCapabilities>>1) & 0x01;
  numProf = (param->RecAppCapabilities>>4) & 0x07;
  memcpy(&cmd[13], param->RecDevTypeList, numDev);
  memcpy(&cmd[13+numDev], param->RecProfileIdList, numProf);
  cmd[13+numDev+numProf] = param->DiscReqLQI;
  cmd[1] = 12 + numDev + numProf;
  cmd[14+numDev+numProf] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  NLME network cop discovery confirmation.
  *@param  Packet
  *@retval success
  */
static uint32_t nwkCop_NLME_DISCOVERY_confirm(uint8_t *packet)
{
  uint8_t paramLen;
  uint8_t *cmdParam;
  NLME_DISCOVERY_CONFIRM_Type param;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen < 5)
    return NWKCOP_WRONG_PARAM_LENGTH;

  memcpy(&param.Status, cmdParam, 4);
  param.NumNodes = cmdParam[4];
  memset(param.NodeDescList, 0, sizeof(NodeDescType)*param.NumNodes);
  memcpy(param.NodeDescList, &cmdParam[5], sizeof(NodeDescType)*param.NumNodes);

  NLME_DISCOVERY_confirm (&param);
  
  return SUCCESS;
}

/**@brief  get NLME
  *@param  NLME_GET_Type
  *@retval status
  */
uint32_t NLME_Get(NLME_GET_Type *param)
{
  uint32_t status;
  uint8_t cmd[6];
  uint8_t rsp[255];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x03;
  cmd[2] = NWKCOP_NLME_GET;
  cmd[3] = param->NIBAttribute;
  cmd[4] = param->NIBAttributeIndex;
  cmd[5] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);
  if (status == SUCCESS) {
    status = receiveHostCmd(rsp);
    if ((status == SUCCESS) && (rsp[2] == NWKCOP_NLME_GET)) {
      switch(param->NIBAttribute) {
      case 0x68:
	memcpy(param->NIBAttributeValue, &rsp[3], sizeof(PairingTableEntryType));
	break;
      case 0x6f:
	memcpy(param->NIBAttributeValue, &rsp[3], 16);
	break;
      default:
	memcpy(param->NIBAttributeValue, &rsp[3], 4);
      }
    }
  }

  return status;
}

/**@brief  NLME pairing request
  *@param  NLME_PAIR_REQUEST_Type
  *@retval status
  */
uint32_t NLME_PAIR_request (NLME_PAIR_REQUEST_Type *param)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[255];
  uint8_t numDev, numProf;

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[2] = NWKCOP_NLME_PAIR_REQUEST;
  cmd[3] = param->LogicalChannel;
  memcpy(&cmd[4], &param->DstPANId, 2);
  memcpy(&cmd[6], param->DstIEEEAddr, 8);
  cmd[14] = param->OrgAppCapabilities;
  numDev = (param->OrgAppCapabilities>>1) & 0x01;
  numProf = (param->OrgAppCapabilities>>4) & 0x07;
  memcpy(&cmd[15], param->OrgDevTypeList, numDev);
  memcpy(&cmd[15+numDev], param->OrgProfileIdList, numProf);
  cmd[15+numDev+numProf] = param->KeyExTransferCount;
  cmd[1] = 14 + numDev + numProf;
  cmd[16+numDev+numProf] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);
  
