Gilezzz/LanderEmbeddedSystem/LanderSTM/Drivers/STM-ZIGBEE-TOOLS/STM32W108xx_Zigbee_RF4CE_V2.0.1/Projects/RF4CE/ZRC_Coprocessor/STM3210E-EVAL/Project/src/rf4ce_cmds.c
  return status;  
}

/**@brief  NLME network cop pairing indication
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLME_PAIR_indication(uint8_t *packet)
{
  uint8_t paramLen, start, numDev, numProf;
  uint8_t *cmdParam;
  NLME_PAIR_INDICATION_Type params;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen < 28)
    return NWKCOP_WRONG_PARAM_LENGTH;

  memset(&params, 0, sizeof(NLME_PAIR_INDICATION_Type));

  memcpy(&params.Status, &cmdParam[0], 4);
  memcpy(&params.SrcPANId, &cmdParam[4], 2);
  memcpy(params.SrcIEEEAddr, &cmdParam[6], 8);
  params.OrgNodeCapabilities = cmdParam[14];
  memcpy(&params.OrgVendorId, &cmdParam[15], 2);
  memcpy(params.OrgVendorString, &cmdParam [17], 8);
  params.OrgAppCapabilities = cmdParam[25];
  start = 26;
  if(params.OrgAppCapabilities&0x1) {
    memcpy(params.OrgUserString, &cmdParam[26], 16);
    start = 42;
  } 
  numDev = (params.OrgAppCapabilities>>1) & 0x01;
  numProf = (params.OrgAppCapabilities>>4) & 0x07;
  memcpy(params.OrgDevTypeList, &cmdParam[start], numDev);
  memcpy(params.OrgProfileIdList, &cmdParam[start+numDev], numProf);
  params.ProvPairingRef = cmdParam[start+numDev+numProf];

  NLME_PAIR_indication (&params);

  return SUCCESS;
}

/**@brief  NLME pairing response
  *@param  NLME_PAIR_RESPONSE_Type
  *@retval status
  */
uint32_t NLME_PAIR_response(NLME_PAIR_RESPONSE_Type *param)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[255];
  uint8_t numDev, numProf;

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[2] = NWKCOP_NLME_PAIR_RESPONSE;
  memcpy(&cmd[3], &param->Status, 4);
  memcpy(&cmd[7], &param->DstPANId, 2);
  memcpy(&cmd[9], param->DstIEEEAddr, 8);
  cmd[17] = param->RecAppCapabilities;
  numDev = (param->RecAppCapabilities>>1) & 0x01;
  numProf = (param->RecAppCapabilities>>4) & 0x07;
  memcpy(&cmd[18], param->RecDevTypeList, numDev);
  memcpy(&cmd[18+numDev], param->RecProfileIdList, numProf);
  cmd[18+numDev+numProf] = param->ProvPairingRef;
  cmd[1] = 17 + numDev + numProf;
  cmd[19+numDev+numProf] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;  
}

/**@brief  NLME network cop pairing confirmation
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLME_PAIR_confirm(uint8_t *packet)
{
  uint8_t paramLen, numDev, numProf, start;
  uint8_t *cmdParam;
  NLME_PAIR_CONFIRM_Type params;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];  
  if (paramLen < 15)
    return NWKCOP_WRONG_PARAM_LENGTH;

  memset(&params, 0, sizeof(NLME_PAIR_CONFIRM_Type));
  
  memcpy(&params.Status, &cmdParam[0], 4);
  params.PairingRef = cmdParam[4];
  memcpy(&params.RecVendorId, &cmdParam[5], 2);
  memcpy(params.RecVendorString, &cmdParam[7], 8);
  params.RecAppCapabilities = cmdParam[15];
  numDev = (params.RecAppCapabilities>>1) & 0x01;
  numProf = (params.RecAppCapabilities>>4) & 0x07;
  if (params.RecAppCapabilities&0x01) {
    memcpy(params.RecUserString, &cmdParam[16], 16);
    start = 32;
  } else {
    start = 16;
  }
  memcpy(params.RecDevTypeList, &cmdParam[start], numDev);
  memcpy(params.RecProfileIdList, &cmdParam[start+numDev], numProf);

  NLME_PAIR_confirm(&params);

  return SUCCESS;
}

/**@brief  NLME reset request
  *@param  setDEfaultPIB
  *@retval status
  */
uint32_t NLME_RESET_request(bool SetDefaultPIB)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[5];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 2;
  cmd[2] = NWKCOP_NLME_RESET;
  cmd[3] = SetDefaultPIB;
  cmd[4] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;    
}

/**@brief  NLME RX enabling request
  *@param  RxOnDuration
  *@retval status
  */
uint32_t NLME_RX_ENABLE_request (uint32_t RxOnDuration)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[8];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 5;
  cmd[2] = NWKCOP_NLME_RX_ENABLE;
  memcpy(&cmd[3], &RxOnDuration, 4);
  cmd[7] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;    
}

/**@brief  set NLME
  *@param  NLME set type
  *@retval status
  */
uint32_t NLME_Set(NLME_SET_Type *param)
{
  uint32_t status;
  uint8_t cmd[50];
  uint8_t rsp[8];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[2] = NWKCOP_NLME_SET;
  cmd[3] = param->NIBAttribute;
  cmd[4] = param->NIBAttributeIndex;
  switch(param->NIBAttribute) {
  case 0x68:
    memcpy(&cmd[5], param->NIBAttributeValue, sizeof(PairingTableEntryType));
    cmd[5+sizeof(PairingTableEntryType)] = NWKCOP_END_PACKET;
    cmd[1] = 3 + sizeof(PairingTableEntryType);
    break;
  case 0x6f:
    memcpy(&cmd[5], param->NIBAttributeValue, 16);
    cmd[21] = NWKCOP_END_PACKET;
    cmd[1] = 19;
    break;
  default:
    memcpy(&cmd[5], param->NIBAttributeValue, 4);
    cmd[9] = NWKCOP_END_PACKET;
    cmd[1] = 7;
  }

  status = sendHostCmd(cmd);
  if (status == SUCCESS) 
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  start NLME request
  *@param  None
  *@retval status
  */
uint32_t NLME_START_request(void)
{
  uint32_t status;
  uint8_t cmd[9];
  uint8_t rsp[8];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x01;
  cmd[2] = NWKCOP_NLME_START_REQUEST;
  cmd[5] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS) 
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;  
}

/**@brief  start NLME network cop confirmation
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLME_START_confirm(uint8_t *packet)
{
  uint8_t paramLen;
  uint8_t *cmdParam;
  uint32_t status;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen != 4)
    return NWKCOP_WRONG_PARAM_LENGTH;

