Gilezzz/LanderEmbeddedSystem/LanderSTM/Drivers/STM-ZIGBEE-TOOLS/STM32W108xx_Zigbee_RF4CE_V2.0.1/Projects/RF4CE/ZRC_Coprocessor/STM3210E-EVAL/Project/src/rf4ce_cmds.c
  memcpy(&status, &cmdParam[0], 4);

  NLME_START_confirm(&status);

  return SUCCESS;
}

/**@brief  Unpair NLME request
  *@param  pairing reference
  *@retval status
  */
uint32_t NLME_UNPAIR_request (uint8_t PairingRef)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[5];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 2;
  cmd[2] = NWKCOP_NLME_UNPAIR_REQUEST;
  cmd[3] = PairingRef;
  cmd[4] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;    
}


/**@brief  unpair network NLME indication
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLME_UNPAIR_indication(uint8_t *packet)
{
  uint8_t paramLen, PairingRef;
  uint8_t *cmdParam;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen != 1)
    return NWKCOP_WRONG_PARAM_LENGTH;

  PairingRef = cmdParam[0];

  NLME_UNPAIR_indication(&PairingRef);

  return SUCCESS;
}

/**@brief  unpair NLME response
  *@param  pairing reference
  *@retval status
  */
uint32_t NLME_UNPAIR_response(uint8_t PairingRef)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[5];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 2;
  cmd[2] = NWKCOP_NLME_UNPAIR_RESPONSE;
  cmd[3] = PairingRef;
  cmd[4] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;    
}

/**@brief  unpair network cop NLME confirmation
  *@param  packet
  *@retval success
  */
static uint32_t nwkCop_NLME_UNPAIR_confirm(uint8_t *packet)
{
  uint8_t paramLen;
  uint8_t *cmdParam;
  NLME_UNPAIR_CONFIRM_Type param;

  paramLen = packet[1] - 1;
  cmdParam = &packet[3];
  if (paramLen != 5)
    return NWKCOP_WRONG_PARAM_LENGTH;

  memcpy(&param.Status, &cmdParam[0], 4);
  param.PairingRef = cmdParam[4];

  NLME_UNPAIR_confirm(&param);

  return SUCCESS;
}

/**@brief  Update NLME key request
  *@param  pairing reference
  *@param  linkKeyType 
  *@retval status
  */
uint32_t NLME_UPDATE_KEY_request(uint8_t PairingRef, linkKeyType NewLinkKey)
{
  uint32_t status;
  uint8_t rsp[7];
  uint8_t cmd[21];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 18;
  cmd[2] = NWKCOP_NLME_UPDATE_KEY;
  cmd[3] = PairingRef;
  memcpy(&cmd[4], NewLinkKey, 16);
  cmd[20] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;    
}

/**@brief  Initialize NWK
  *@param  node Cap
  *@param  force cold start
  *@retval status
  */
uint32_t NWK_Init(uint8_t nodeCap, bool forceColdStart)
{
  uint32_t status;
  uint8_t cmd[6];
  uint8_t rsp[7];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x03;
  cmd[2] = NWKCOP_NWK_INIT;
  cmd[3] = nodeCap;
  cmd[4] = forceColdStart;
  cmd[5] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS) 
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  response callback
  *@param  packet
  *@retval status
  */
void RspCallback(uint8_t *packet)
{
  uint32_t status=0;
  
  switch(packet[2]) {
  case NWKCOP_NLDE_DATA_INDICATION:
    status = nwkCop_NLDE_DATA_indication(packet);
    break;
  case NWKCOP_NLDE_DATA_CONFIRM:
    status = nwkCop_NLDE_DATA_confirm(packet);
    break;
  case NWKCOP_NLME_AUTO_DISCOVERY_CONFIRM:
    status = nwkCop_NLME_AUTO_DISCOVERY_confirm(packet);
    break;
  case NWKCOP_NLME_COMM_STATUS_INDICATION:
    status = nwkCop_NLME_COMM_STATUS_indication(packet);
    break;
  case NWKCOP_NLME_DISCOVERY_INDICATION:
    status = nwkCop_NLME_DISCOVERY_indication(packet);
    break;
  case NWKCOP_NLME_DISCOVERY_CONFIRM:
    status = nwkCop_NLME_DISCOVERY_confirm(packet);
    break;
  case NWKCOP_NLME_PAIR_INDICATION:
    status = nwkCop_NLME_PAIR_indication(packet);
    break;
  case NWKCOP_NLME_PAIR_CONFIRM:
    status = nwkCop_NLME_PAIR_confirm(packet);
    break;
  case NWKCOP_NLME_START_CONFIRM:
    status = nwkCop_NLME_START_confirm(packet);
    break;
  case NWKCOP_NLME_UNPAIR_INDICATION:
    status = nwkCop_NLME_UNPAIR_indication(packet);
    break;
  case NWKCOP_NLME_UNPAIR_CONFIRM:
    status = nwkCop_NLME_UNPAIR_confirm(packet);
    break;
  default:
    printf("Code received %d !!!!!!!\r\n", packet[2]);
  }
  
  if (status != SUCCESS)
    printf("Error 0x%08x in function %02x \r\n", status, packet[2]);
}

/**@brief  Get the MAC Eui64
  *@param  eui64
  *@retval status
  */
uint32_t MAC_GetEui64(uint8_t *eui64)
{
  uint32_t status;
  uint8_t cmd[4];
  uint8_t rsp[12];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x01;
  cmd[2] = NWKCOP_MAC_GET_EUI64;
  cmd[3] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);
  if (status == SUCCESS) {
    status = receiveHostCmd(rsp);
    if (status == SUCCESS) {
      memcpy(eui64, &rsp[3], 8);
    }
  }
  return status;  
}

/**@brief  set MAC Eui64 identifier
  *@param  eui64
  *@retval status
  */
uint32_t MAC_SetEui64(uint8_t *eui64)
{
  uint32_t status;
  uint8_t cmd[12];
  uint8_t rsp[7];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x09;
  cmd[2] = NWKCOP_MAC_SET_EUI64;
  memcpy(&cmd[3], eui64, 8);
  cmd[11] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;  
}

/**@brief  GEt network cop formware version
  *@param  nwkCop_ver
  *@param  rf4ce_ver
  *@retval status
  */
uint32_t nwkCop_FirmwareVersion(uint8_t *nwkCop_ver, uint8_t *rf4ce_ver)
{
  uint32_t status;
  uint8_t cmd[4];
  uint8_t rsp[10];

  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x01;
  cmd[2] = NWKCOP_FIRMWARE_VERSION;
  cmd[3] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS) 
    memcpy(&status, &rsp[2], 4);
  if (status == SUCCESS)
    status = receiveHostCmd(rsp);
  memcpy(nwkCop_ver, &rsp[3], 3);
  memcpy(rf4ce_ver, &rsp[6], 3);

