Gilezzz/LanderEmbeddedSystem/LanderSTM/Drivers/STM-ZIGBEE-TOOLS/STM32W108xx_Zigbee_RF4CE_V2.0.1/Projects/RF4CE/ZRC_Coprocessor/STM3210E-EVAL/Project/src/rf4ce_cmds.c
  return status;  
}

/**@brief  Ebnable power saving
  *@param  power save type
  *@retval status
  */
uint32_t nwkCop_enablePowerSave(uint8_t powerSaveType)
{
  uint32_t status;
  uint8_t cmd[5];
  uint8_t rsp[7];
  
  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x02;
  cmd[2] = NWKCOP_POWER_DOWN;
  cmd[3] = powerSaveType;
  cmd[4] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  Disable power saving
  *@param  None
  *@retval status
  */
uint32_t nwkCop_disablePowerSave(void)
{
  uint32_t status;
  uint8_t cmd[4];
  uint8_t rsp[7];
  
  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x01;
  cmd[2] = NWKCOP_POWER_UP;
  cmd[3] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  Erase NVM nwkCop
  *@param  None
  *@retval status
  */
uint32_t nwkCop_NVM_Erase(void)
{
  uint32_t status;
  uint8_t cmd[4];
  uint8_t rsp[7];
  
  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[1] = 0x01;
  cmd[2] = NWKCOP_NVM_ERASE;
  cmd[3] = NWKCOP_END_PACKET;

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}

/**@brief  NWK configuration
  *@param  parameter identifier
  *@param  parameter value  
  *@retval status
  */
uint32_t NWK_Config(uint32_t parameterID, void *parameterValue)
{
  uint32_t status;
  uint8_t cmd[16];
  uint8_t rsp[7];
  
  cmd[0] = NWKCOP_COMMAND_PACKET;
  cmd[2] = NWKCOP_NWK_CONFIG;  
  memcpy(&cmd[3], &parameterID, 4);
  if (parameterID == nwkcVendorIdentifier_ID) {
    cmd[1] = 0x07;
    memcpy(&cmd[7], parameterValue, 2);
    cmd[9] = NWKCOP_END_PACKET;
  } else {
    if (parameterID == nwkcVendorString_ID) {
      cmd[1] = 13;
      memcpy(&cmd[7], parameterValue, 8);
      cmd[15] = NWKCOP_END_PACKET;
    }
  }

  status = sendHostCmd(cmd);
  if (status == SUCCESS)
    status = waitRspCmd(rsp);
  if (status == SUCCESS)
    memcpy(&status, &rsp[2], 4);

  return status;
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
